"Windows Azure Cloud Storage" = "Windows Azure 云存储";

/* Azure Login Credentials */
"Public Storage Account Name" = "公共储存账户名称";
"Primary Access Key" = "主访问键";

"Windows Azure CDN" = "Windows Azure 内容分发网络";